In [1]:
from pandasql import sqldf, load_meat, load_births

In [2]:
meat = load_meat()
births = load_births()
pysqldf = lambda q: sqldf(q, globals())

In [3]:
print(type(meat)) # loads the meat dataset
print(type(births))
print(pysqldf)

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<function <lambda> at 0x7fda5e1a0820>

In [8]:
#meat[15:26]
meat.head()

,date,beef,veal,pork,lamb_and_mutton,broilers,other_chicken,turkey
0,1944-01-01,751.0,85.0,1280.0,89.0,NaN,NaN,NaN
1,1944-02-01,713.0,77.0,1169.0,72.0,NaN,NaN,NaN
2,1944-03-01,741.0,90.0,1128.0,75.0,NaN,NaN,NaN
3,1944-04-01,650.0,89.0,978.0,66.0,NaN,NaN,NaN
4,1944-05-01,681.0,106.0,1029.0,78.0,NaN,NaN,NaN

In [9]:
meat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 827 entries, 0 to 826
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             827 non-null    datetime64[ns]
 1   beef             827 non-null    float64
 2   veal             827 non-null    float64
 3   pork             827 non-null    float64
 4   lamb_and_mutton  827 non-null    float64
 5   broilers         635 non-null    float64
 6   other_chicken    143 non-null    float64
 7   turkey           635 non-null    float64
dtypes: datetime64[ns](1), float64(7)
memory usage: 51.8 KB

In [10]:
births.head()

        date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

In [11]:
births.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 408 entries, 0 to 407
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    408 non-null    datetime64[ns]
 1   births  408 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 6.5 KB

In [12]:
births.describe()

              births
count     408.000000
mean   320585.502451
std     29449.011996
min    236551.000000
25%    303456.500000
50%    325625.500000
75%    342046.750000
max    387798.000000

In [13]:
print(pysqldf("SELECT * FROM meat LIMIT 23;")) # select all columns from the table "meat"

                          date    beef   veal    pork  lamb_and_mutton  \
0   1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1   1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2   1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3   1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4   1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
5   1944-06-01 00:00:00.000000   658.0  125.0   962.0             79.0
6   1944-07-01 00:00:00.000000   662.0  142.0   796.0             82.0
7   1944-08-01 00:00:00.000000   787.0  175.0   748.0             87.0
8   1944-09-01 00:00:00.000000   774.0  182.0   678.0             91.0
9   1944-10-01 00:00:00.000000   834.0  215.0   777.0            100.0
10  1944-11-01 00:00:00.000000   786.0  197.0   944.0             91.0
11  1944-12-01 00:00:00.000000   764.0  146.0  1013.0             91.0
12  1945-01-01 00:00:00.000000   820.0  119.0  1037.0            100.0
13  1945-02-01 00:00:00.000000   816.0   97.0   724.0             81.0
14  1945-03-01 00:00:00.000000   836.0  107.0   723.0             87.0
15  1945-04-01 00:00:00.000000   736.0   98.0   651.0             78.0
16  1945-05-01 00:00:00.000000   747.0  103.0   682.0             87.0
17  1945-06-01 00:00:00.000000   739.0  110.0   674.0             87.0
18  1945-07-01 00:00:00.000000   736.0  117.0   610.0             82.0
19  1945-08-01 00:00:00.000000   858.0  145.0   531.0             77.0
20  1945-09-01 00:00:00.000000   910.0  164.0   535.0             80.0
21  1945-10-01 00:00:00.000000  1022.0  201.0   628.0             95.0
22  1945-11-01 00:00:00.000000   933.0  173.0   945.0             86.0

   broilers other_chicken turkey
0      None          None   None
1      None          None   None
2      None          None   None
3      None          None   None
4      None          None   None
5      None          None   None
6      None          None   None
7      None          None   None
8      None          None   None
9      None          None   None
10     None          None   None
11     None          None   None
12     None          None   None
13     None          None   None
14     None          None   None
15     None          None   None
16     None          None   None
17     None          None   None
18     None          None   None
19     None          None   None
20     None          None   None
21     None          None   None
22     None          None   None

## SELECT

* Use SELECT to specify Columns.
    e.g. SELECT beef
* USE SELECT * to select all columns
    e.g. SELECT *
    
Note: "SELECT *" is an incomplete query. You must also specify the table using FROM.

## FROM

We use the FROM statement to specify a table. 

Here we have two tables called "meat" and "births." You can try SELECT * on any of them.

In [15]:
print(pysqldf("SELECT * FROM births;"))

                           date  births
0    1975-01-01 00:00:00.000000  265775
1    1975-02-01 00:00:00.000000  241045
2    1975-03-01 00:00:00.000000  268849
3    1975-04-01 00:00:00.000000  247455
4    1975-05-01 00:00:00.000000  254545
..                          ...     ...
403  2012-08-01 00:00:00.000000  359554
404  2012-09-01 00:00:00.000000  361922
405  2012-10-01 00:00:00.000000  347625
406  2012-11-01 00:00:00.000000  320195
407  2012-12-01 00:00:00.000000  340995

[408 rows x 2 columns]

In [16]:
# example

print(pysqldf("SELECT date FROM meat;"))

                           date
0    1944-01-01 00:00:00.000000
1    1944-02-01 00:00:00.000000
2    1944-03-01 00:00:00.000000
3    1944-04-01 00:00:00.000000
4    1944-05-01 00:00:00.000000
..                          ...
822  2012-07-01 00:00:00.000000
823  2012-08-01 00:00:00.000000
824  2012-09-01 00:00:00.000000
825  2012-10-01 00:00:00.000000
826  2012-11-01 00:00:00.000000

[827 rows x 1 columns]

In [17]:
print(pysqldf("SELECT beef FROM meat;"))

       beef
0     751.0
1     713.0
2     741.0
3     650.0
4     681.0
..      ...
822  2200.8
823  2367.5
824  2016.0
825  2343.7
826  2206.6

[827 rows x 1 columns]

In [18]:
print(pysqldf("SELECT veal FROM meat;"))

      veal
0     85.0
1     77.0
2     90.0
3     89.0
4    106.0
..     ...
822    9.5
823   10.1
824    8.8
825   10.3
826   10.1

[827 rows x 1 columns]

In [19]:
print(pysqldf("SELECT * FROM meat;"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
822  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
823  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
824  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
825  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
826  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
822    3127.0           43.4   497.2
823    3317.4           51.0   530.1
824    2927.1           43.7   453.1
825    3335.0           43.8   579.9
826    3006.7           37.5   515.3

[827 rows x 8 columns]

## LIMIT

Use limit to get the top n number of items from the query. You can use limit when you want a different number of items from the default.

In [ ]:
print(pysqldf("SELECT * FROM meat LIMIT 3;"))

In [ ]:
print(pysqldf("SELECT beef FROM meat LIMIT 70;"))

# WHERE

In [20]:
print(pysqldf("SELECT * FROM meat;"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
822  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
823  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
824  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
825  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
826  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
822    3127.0           43.4   497.2
823    3317.4           51.0   530.1
824    2927.1           43.7   453.1
825    3335.0           43.8   579.9
826    3006.7           37.5   515.3

[827 rows x 8 columns]

In [ ]:
print(pysqldf("SELECT * FROM meat WHERE beef<700;"))

In [ ]:
print(pysqldf("SELECT * FROM meat WHERE beef<700 LIMIT 10;"))

In [ ]:
print(pysqldf("SELECT * FROM meat WHERE veal < 100;"))

In [ ]:
## SELECT multiple columns

print(pysqldf("SELECT date, beef FROM meat WHERE veal < 100;"))

# AS

In [21]:
# Create new column
print(pysqldf("SELECT date, beef, veal, \
                ((beef + veal) / 2) AS beef_veal_avg \
                FROM meat \
                WHERE veal < 100;"))

                           date    beef  veal  beef_veal_avg
0    1944-01-01 00:00:00.000000   751.0  85.0         418.00
1    1944-02-01 00:00:00.000000   713.0  77.0         395.00
2    1944-03-01 00:00:00.000000   741.0  90.0         415.50
3    1944-04-01 00:00:00.000000   650.0  89.0         369.50
4    1945-02-01 00:00:00.000000   816.0  97.0         456.50
..                          ...     ...   ...            ...
705  2012-07-01 00:00:00.000000  2200.8   9.5        1105.15
706  2012-08-01 00:00:00.000000  2367.5  10.1        1188.80
707  2012-09-01 00:00:00.000000  2016.0   8.8        1012.40
708  2012-10-01 00:00:00.000000  2343.7  10.3        1177.00
709  2012-11-01 00:00:00.000000  2206.6  10.1        1108.35

[710 rows x 4 columns]

# Logical operations


* LIKE
* IN
* BETWEEN
* IS NULL
* AND
* OR
* NOT

In [24]:
# LIKE; Find similar values, not necessarilyb exact

print(pysqldf("SELECT date, beef FROM meat WHERE date LIKE '2012%';"))

                          date    beef
0   2012-01-01 00:00:00.000000  2113.8
1   2012-02-01 00:00:00.000000  2009.0
2   2012-03-01 00:00:00.000000  2159.8
3   2012-04-01 00:00:00.000000  1990.6
4   2012-05-01 00:00:00.000000  2232.0
5   2012-06-01 00:00:00.000000  2252.1
6   2012-07-01 00:00:00.000000  2200.8
7   2012-08-01 00:00:00.000000  2367.5
8   2012-09-01 00:00:00.000000  2016.0
9   2012-10-01 00:00:00.000000  2343.7
10  2012-11-01 00:00:00.000000  2206.6

In [27]:
# IN; queries matches values specified in IN.

print(pysqldf("SELECT date, beef FROM meat WHERE beef IN (842, 591);"))

                         date   beef
0  1951-01-01 00:00:00.000000  842.0
1  1951-06-01 00:00:00.000000  591.0

In [37]:
# BETWEEN; Query returns items that fall between a range.

print(pysqldf("SELECT date, beef FROM meat WHERE beef BETWEEN 591 AND 842 ORDER BY beef;"))

                          date   beef
0   1951-06-01 00:00:00.000000  591.0
1   1946-05-01 00:00:00.000000  605.0
2   1944-04-01 00:00:00.000000  650.0
3   1948-05-01 00:00:00.000000  650.0
4   1951-02-01 00:00:00.000000  650.0
..                         ...    ...
84  1945-03-01 00:00:00.000000  836.0
85  1947-07-01 00:00:00.000000  839.0
86  1946-10-01 00:00:00.000000  840.0
87  1952-09-01 00:00:00.000000  841.0
88  1951-01-01 00:00:00.000000  842.0

[89 rows x 2 columns]

In [28]:
"""
IS NULL; will return entries that have NULL values specified by WHERE.
IS NOT NULL;
"""
print(pysqldf("SELECT * FROM meat WHERE broilers IS NOT NULL"))

                           date    beef  veal    pork  lamb_and_mutton  \
0    1960-01-01 00:00:00.000000  1196.0  79.0  1058.0             68.0
1    1960-02-01 00:00:00.000000  1089.0  73.0   940.0             60.0
2    1960-03-01 00:00:00.000000  1201.0  83.0   981.0             61.0
3    1960-04-01 00:00:00.000000  1066.0  75.0   910.0             59.0
4    1960-05-01 00:00:00.000000  1202.0  77.0   905.0             61.0
..                          ...     ...   ...     ...              ...
630  2012-07-01 00:00:00.000000  2200.8   9.5  1721.8             12.5
631  2012-08-01 00:00:00.000000  2367.5  10.1  1997.9             14.2
632  2012-09-01 00:00:00.000000  2016.0   8.8  1911.0             12.5
633  2012-10-01 00:00:00.000000  2343.7  10.3  2210.4             14.2
634  2012-11-01 00:00:00.000000  2206.6  10.1  2078.7             12.4

     broilers  other_chicken  turkey
0       255.9            NaN    22.1
1       250.9            NaN    14.0
2       283.6            NaN    13.4
3       301.6            NaN    16.2
4       331.7            NaN    27.1
..        ...            ...     ...
630    3127.0           43.4   497.2
631    3317.4           51.0   530.1
632    2927.1           43.7   453.1
633    3335.0           43.8   579.9
634    3006.7           37.5   515.3

[635 rows x 8 columns]

In [29]:
print(pysqldf("SELECT * FROM meat WHERE lamb_and_mutton IS NOT NULL"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
822  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
823  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
824  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
825  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
826  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
822    3127.0           43.4   497.2
823    3317.4           51.0   530.1
824    2927.1           43.7   453.1
825    3335.0           43.8   579.9
826    3006.7           37.5   515.3

[827 rows x 8 columns]

In [34]:
# AND; allows you to select rows that statisfy two conditions.

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NULL OR pork > 1000"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
4    1944-12-01 00:00:00.000000   764.0  146.0  1013.0             91.0
..                          ...     ...    ...     ...              ...
559  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
560  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
561  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
562  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
563  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
559    3127.0           43.4   497.2
560    3317.4           51.0   530.1
561    2927.1           43.7   453.1
562    3335.0           43.8   579.9
563    3006.7           37.5   515.3

[564 rows x 8 columns]

In [31]:
# OR; Allows you to choose rows that satisfy one of the two conditions specified by WHERE.

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
822  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
823  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
824  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
825  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
826  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
822    3127.0           43.4   497.2
823    3317.4           51.0   530.1
824    2927.1           43.7   453.1
825    3335.0           43.8   579.9
826    3006.7           37.5   515.3

[827 rows x 8 columns]

In [35]:
# Don't forget LIMIT. LIMIT still works.


print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100 \
                  LIMIT 30;"))

                          date    beef   veal    pork  lamb_and_mutton  \
0   1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1   1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2   1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3   1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4   1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
5   1944-06-01 00:00:00.000000   658.0  125.0   962.0             79.0
6   1944-07-01 00:00:00.000000   662.0  142.0   796.0             82.0
7   1944-08-01 00:00:00.000000   787.0  175.0   748.0             87.0
8   1944-09-01 00:00:00.000000   774.0  182.0   678.0             91.0
9   1944-10-01 00:00:00.000000   834.0  215.0   777.0            100.0
10  1944-11-01 00:00:00.000000   786.0  197.0   944.0             91.0
11  1944-12-01 00:00:00.000000   764.0  146.0  1013.0             91.0
12  1945-01-01 00:00:00.000000   820.0  119.0  1037.0            100.0
13  1945-02-01 00:00:00.000000   816.0   97.0   724.0             81.0
14  1945-03-01 00:00:00.000000   836.0  107.0   723.0             87.0
15  1945-04-01 00:00:00.000000   736.0   98.0   651.0             78.0
16  1945-05-01 00:00:00.000000   747.0  103.0   682.0             87.0
17  1945-06-01 00:00:00.000000   739.0  110.0   674.0             87.0
18  1945-07-01 00:00:00.000000   736.0  117.0   610.0             82.0
19  1945-08-01 00:00:00.000000   858.0  145.0   531.0             77.0
20  1945-09-01 00:00:00.000000   910.0  164.0   535.0             80.0
21  1945-10-01 00:00:00.000000  1022.0  201.0   628.0             95.0
22  1945-11-01 00:00:00.000000   933.0  173.0   945.0             86.0
23  1945-12-01 00:00:00.000000   783.0  118.0  1103.0             90.0
24  1946-01-01 00:00:00.000000   856.0  101.0  1051.0             74.0
25  1946-02-01 00:00:00.000000   827.0   85.0   966.0            109.0
26  1946-03-01 00:00:00.000000   796.0   92.0   780.0             97.0
27  1946-04-01 00:00:00.000000   734.0   91.0   846.0             83.0
28  1946-05-01 00:00:00.000000   605.0   83.0   810.0             65.0
29  1946-06-01 00:00:00.000000   461.0   78.0   505.0             75.0

   broilers other_chicken turkey
0      None          None   None
1      None          None   None
2      None          None   None
3      None          None   None
4      None          None   None
5      None          None   None
6      None          None   None
7      None          None   None
8      None          None   None
9      None          None   None
10     None          None   None
11     None          None   None
12     None          None   None
13     None          None   None
14     None          None   None
15     None          None   None
16     None          None   None
17     None          None   None
18     None          None   None
19     None          None   None
20     None          None   None
21     None          None   None
22     None          None   None
23     None          None   None
24     None          None   None
25     None          None   None
26     None          None   None
27     None          None   None
28     None          None   None
29     None          None   None

In [38]:
# ORDER BY; Order the rows by the specified column.

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100 \
                  ORDER BY pork \
                  LIMIT 10;"))

                         date    beef   veal   pork  lamb_and_mutton broilers  \
0  1946-09-01 00:00:00.000000   366.0   98.0  124.0             63.0     None
1  1948-08-01 00:00:00.000000   705.0  121.0  463.0             59.0     None
2  1946-06-01 00:00:00.000000   461.0   78.0  505.0             75.0     None
3  1948-09-01 00:00:00.000000   773.0  127.0  514.0             68.0     None
4  1945-08-01 00:00:00.000000   858.0  145.0  531.0             77.0     None
5  1947-08-01 00:00:00.000000   766.0  131.0  534.0             57.0     None
6  1945-09-01 00:00:00.000000   910.0  164.0  535.0             80.0     None
7  1947-09-01 00:00:00.000000   888.0  154.0  549.0             66.0     None
8  1948-07-01 00:00:00.000000   681.0  116.0  576.0             55.0     None
9  1953-08-01 00:00:00.000000  1007.0  142.0  582.0             55.0     None

  other_chicken turkey
0          None   None
1          None   None
2          None   None
3          None   None
4          None   None
5          None   None
6          None   None
7          None   None
8          None   None
9          None   None

In [39]:
# ORDER BY; Order the rows by the specified column. This time in descending order.

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100 \
                  ORDER BY pork DESC\
                  LIMIT 10;"))

                         date    beef  veal    pork  lamb_and_mutton  \
0  2012-10-01 00:00:00.000000  2343.7  10.3  2210.4             14.2
1  2008-10-01 00:00:00.000000  2340.9  13.5  2159.9             15.0
2  2008-01-01 00:00:00.000000  2232.7  11.3  2159.0             14.7
3  2007-10-01 00:00:00.000000  2443.0  11.1  2145.1             16.4
4  2009-10-01 00:00:00.000000  2275.7  12.2  2089.0             14.3
5  2011-11-01 00:00:00.000000  2148.8  10.8  2086.7             12.6
6  2012-11-01 00:00:00.000000  2206.6  10.1  2078.7             12.4
7  2010-11-01 00:00:00.000000  2235.5  11.3  2068.0             14.4
8  2011-12-01 00:00:00.000000  2126.3  10.8  2065.6             12.5
9  2010-12-01 00:00:00.000000  2270.9  11.7  2055.4             14.9

   broilers  other_chicken  turkey
0    3335.0           43.8   579.9
1    3270.6           50.6   581.8
2    3237.2           45.7   546.4
3    3383.8           47.6   585.1
4    3071.9           44.6   508.3
5    2907.1           39.8   511.4
6    3006.7           37.5   515.3
7    3124.4           40.3   520.5
8    2855.8           41.4   458.9
9    3175.0           44.1   461.4

In [40]:
# GROUP BY; G

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100 \
                  GROUP BY beef_high_priced \
                  LIMIT 30;"))

                          date   beef   veal    pork  lamb_and_mutton  \
0   1946-09-01 00:00:00.000000  366.0   98.0   124.0             63.0
1   1946-06-01 00:00:00.000000  461.0   78.0   505.0             75.0
2   1951-06-01 00:00:00.000000  591.0   78.0   798.0             39.0
3   1946-05-01 00:00:00.000000  605.0   83.0   810.0             65.0
4   1944-04-01 00:00:00.000000  650.0   89.0   978.0             66.0
5   1944-06-01 00:00:00.000000  658.0  125.0   962.0             79.0
6   1944-07-01 00:00:00.000000  662.0  142.0   796.0             82.0
7   1950-02-01 00:00:00.000000  676.0   80.0   699.0             46.0
8   1944-05-01 00:00:00.000000  681.0  106.0  1029.0             78.0
9   1952-03-01 00:00:00.000000  685.0   70.0   924.0             51.0
10  1950-04-01 00:00:00.000000  694.0   87.0   702.0             44.0
11  1951-03-01 00:00:00.000000  696.0   73.0   837.0             39.0
12  1949-02-01 00:00:00.000000  697.0   82.0   701.0             51.0
13  1952-06-01 00:00:00.000000  698.0   83.0   727.0             46.0
14  1951-12-01 00:00:00.000000  699.0   68.0  1077.0             41.0
15  1948-04-01 00:00:00.000000  700.0  101.0   629.0             53.0
16  1952-04-01 00:00:00.000000  703.0   71.0   839.0             50.0
17  1948-08-01 00:00:00.000000  705.0  121.0   463.0             59.0
18  1944-02-01 00:00:00.000000  713.0   77.0  1169.0             72.0
19  1951-05-01 00:00:00.000000  716.0   71.0   798.0             34.0
20  1949-12-01 00:00:00.000000  717.0   97.0  1041.0             53.0
21  1949-04-01 00:00:00.000000  721.0   91.0   647.0             34.0
22  1948-03-01 00:00:00.000000  727.0   99.0   672.0             60.0
23  1948-06-01 00:00:00.000000  733.0  118.0   774.0             58.0
24  1946-04-01 00:00:00.000000  734.0   91.0   846.0             83.0
25  1945-04-01 00:00:00.000000  736.0   98.0   651.0             78.0
26  1945-06-01 00:00:00.000000  739.0  110.0   674.0             87.0
27  1944-03-01 00:00:00.000000  741.0   90.0  1128.0             75.0
28  1952-05-01 00:00:00.000000  742.0   77.0   736.0             49.0
29  1949-07-01 00:00:00.000000  743.0  103.0   584.0             45.0

   broilers other_chicken turkey
0      None          None   None
1      None          None   None
2      None          None   None
3      None          None   None
4      None          None   None
5      None          None   None
6      None          None   None
7      None          None   None
8      None          None   None
9      None          None   None
10     None          None   None
11     None          None   None
12     None          None   None
13     None          None   None
14     None          None   None
15     None          None   None
16     None          None   None
17     None          None   None
18     None          None   None
19     None          None   None
20     None          None   None
21     None          None   None
22     None          None   None
23     None          None   None
24     None          None   None
25     None          None   None
26     None          None   None
27     None          None   None
28     None          None   None
29     None          None   None

In [ ]:

print(pysqldf("SELECT *, \
                  CASE WHEN beef > 600 THEN 'expensive' \
                  ELSE 'cheap' END AS price_category \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100;"))

In [ ]:
print(pysqldf("SELECT *, \
                  CASE WHEN beef > 600 OR pork > 800 THEN 'expensive' \
                  ELSE 'cheap' END AS price_category \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100;"))

In [ ]:
print(pysqldf("SELECT *, \
                  CASE WHEN beef > 600 OR pork > 800 THEN 'expensive' \
                  ELSE 'cheap' END AS price_category \
                  FROM meat \
                  GROUP BY price_category"))